{
	"name": "ADaywithIzebel",
	"CardType": "DayShift",
	"CardLimit": "0",
	"Description": "BarShift",
	"requires": [""],
	"Speakers": [{
			"name": "AdultXiongmao",
			"postName": "",
			"SpeakerType": "Monster"
		},
		{
			"name": "Vivian",
			"postName": "",
			"SpeakerType": "Monster"
		},
    {
      "name": "Izebel",
      "postName": "",
      "SpeakerType": "Monster"
    }

	],
	"EventText": [{
			"NameOfScene": "EventStart",
			"theScene": [ "IfHasItem", "Client Card", "EventStart2",
                    "You didn't think a lot would be happening during as it was only the day shift, so you really have nothing else to do except cleaning the glasses for Belle. But as your day continues, you notice a woman you haven't seen before come in the brothel and sit at a table nearby.",
                    "EndLoop",
                    "JumpToScene", "Panda"
]},
{
     "NameOfScene": "Panda",
     "theScene": [ "DisplayCharacters", "1",
                   "EndLoop",
                   "At first glance, you notice that she is older lady and also part bear, but something about her just keeps you staring and admiring her as if under a spell, as she is notably very attractive. But has very much kept to herself",
                   "You try not to stare too much as you're afraid she'll notice. But as you look around the bar, you start to notice it isn't just you that has been taking glances, the whole bar has been eyeing her ever since they first seen her took a seat.",
                   "DisplayCharacters", "1", "2",
                   "As you try to get back to doing your job, you notice Vivian making a rare appearence and walking towards the woman as they both notice each other, Vivian then notions for you to come over. She then smiles at her guest.",
                   "Speaks2",
                   "Its not often you come here, anything I could help you with personally?",
                   "The woman casually snickers and forces a yawn receiving a somewhat annoyed look on Vivian's face.",
                   "Speaks1",
                   "No, I don't think you can Vivian, unless I can get some tea. Or is your breasts all you good for around here?",
                   "Vivian glares at the woman before looking towards you attempting to keep herself calm and avoid attention.",
                   "Speaks2",
                   "One Green Bamboo Tea for Ms. Izebel.",
                   "PlayerSpeaks",
                   "Yes mam",
                   "You go towards the back to find the ingredients for the tea she requested. As you do, Vivian then returns to her patron with a caring smile.",
                   "Speaks2",
                   "I'm assuming you won't be here long?",
                   "The woman gives a small sneer",
									 "DisplayCharacters", "3", "2",
                   "Speaks3",
                   "Well of course, Milady Vivian, why would I ever stay in this brothel when I could find better company elsewhere?",
                   "Vivian is doing her best to keep her appearence about her despite clenching her fist. But then saddens.",
                   "Speaks2",
                   "Look, I know I haven't been the best of...aquantices or business partners, but I was very sorry to hear about your-",
                   "Speaks3",
                   "Forget it. No use dwelling on the past. Plus I have {i}plenty{/i} to live for.",
                   "You return, but turn to Vivian.",
                   "PlayerSpeaks",
                   "I'm sorry, but I checked the storage, it seems we no longer have any of the ingredients, I checked everywhere.",
                   "Once hearing your words, Izebel begins to stand up in slight annoyance.",
                   "Speaks3",
                   "A wasted trip, guess I'll see you later Vivian",
                   "She turns to leave but Vivian stops in front of her before she could get out the door",
                   "Speaks2",
                   "If you don't mind Izebel, while not stay for a bit and rest upstairs? I can arrange a room, besides, with your presence here, you're sure to attract more customers for me.",
                   "Izebel looks annoyed for a second at Vivian but then turns to you, then gives a devilish smug",
                   "Speaks3",
                   "Hmph, I really should be getting back to my shop, but I guess I can stay a while, but I refuse to be your personal attraction, and I'll need a toy to play with so I don't get bored of this place. You know what happened last time I came through this place.",
                   "Vivian notions at you and smiles, knowing instantly it was a sign of trouble.",
                   "Speaks2",
                   "Take him, if he doesn't give a good performance, I'll have Belle kick him out.",
									 "PlayerSpeaks",
									 "KICK ME OUT?!",
									 "Vivian makes a small giggle",
									 "Speaks2",
									 "Aww, don't look at me that way honey, you'll break my heart, you know when my employees don't meet their expectations I have to cut my losses. Besides, you won't fail, you get more compliments than my other waiters.",
                   "Izebel relishes the thought, taking a moment to glance you over up and down, then letting out a sultry giggle.",
                   "Speaks3",
                   "Really now? He is kind of cute...maybe I will, unless he doesn't want to?",
                   "She makes small giggles as her breasts make small enticing bounces, and you have to admit, she has a way about her that makes your head spin, but your also wondering about [i]the last time a bear was in the bar[/i].",
                   "Before you have a chance to say yay or nay, Izebel surprises you with a bear arm and carries you off to a room!",
                   "DisplayCharacters", "2",
                   "Vivian smiles as you glance back at her wondering what she's gotten you into",
                   "Speaks2",
                   "Have fun {ThePlayerName}, treat her well!",
                   "EndLoop",
								   "JumpToScene", "Keeping Company"]
},
{
	"NameOfScene": "Keeping Company",
    "theScene": [ "Display Characters", "3",
	                "Izebel throws you with force on a bed in which you make a slight yelp creating a small giggle from Izebel as she crawls on the bed herself looking down at you.",
								  "Speaks3",
								  "So handsome, what will it be?",
									"You think carefully as your not in a position to argue with her.",
								  "Menu",
								  "Talk?",
								  "Hug?",
									"Sex",
								  "What would you like to do?",
								  "EndLoop"]
},
{
	"NameOfScene": "KeepingCompanyMenu",
	  "theScene": [ "Menu",
			            "Talk?",
									"Hug?",
									"Sex",
									"What would you like to do?",
									"EndLoop"]
},
{
	"NameOfScene": "Talk?",
    "theScene": [ "She looks disappointed and sits up in the bed.",
									"Speaks3",
									"Talkative are you?",
									"She yawns and lays by you, showcasing her chest and thighes as you gather your thoughts.",
									"Menu",
									"Where you from?",
									"You're a bear?",
									"What did you mean by lastime?",
									"Nevermind",
									"EndLoop"]
},
{
	"NameOfScene": "TalkMenu",
    "theScene": [ "Menu",
									"Where you from?",
									"You're a bear?",
									"What did you mean by lastime?",
									"Nevermind",
									"EndLoop"]
},
{
	"NameOfScene": "Where you from?",
    "theScene": [ "Speaks3",
			            "You either must be new to the bar, or never been to Bamboo Hill. But that's where I'm from, along with others like me.",
									"Speaks3",
									"Well, can't say others are like me, but you get what I mean.",
									"Speaks3",
									"Bamboo Road is not far from here actually, its on the right side of the mountainous areas closer to the shore. Can't really miss it for its distinctive trees",
									"Speaks3",
									"If you ever followed the road there, you eventually would see a small village around the base of the Bamboo Hill, my home and shop is based on that hill. I sell things there that I've made that you can't get anywhere else",
									"Speaks3",
									"You would really do good to come by sometime, just watch out for the enemies on the way. There's Kunoichi, Harpies, Xiongmao's. There's even a rare occurence where you can run into a Bunyip",
									"Speaks3",
									"Although...watch out too, there's really terrible chance you'll run into Aruka, she'll get you in trouble in more ways than one...that dumbass monkey, I'd like to tear her to shreds.",
			            "Izebel then collects herself",
									"Speaks3",
									"Anyways, you'll have fun, especially if you come to visit me, just don't expect an actual date.",
									"EndLoop",
									"JumpToScene", "TalkMenu"]
},
{
	"NameOfScene": "You're a bear?",
		"theScene": [ "Izebel gives you a small glare.",
			            "Speaks3",
									"I'm a Panda, don't confuse me with that word. I hate being called that. Most bears are rugged, ugly, and belong under a rock.",
									"Speaks3",
									"Us panda's have more class, we're more beautiful, and more gentle. You would do good to remember that. Of course, we may be the same species, but knowing the difference may save you a world of hurt or even save your life.",
                  "Izebel then gives you another glare",
									"Speaks3",
									"Especially when in my presence, I take things like that seriously, so unless you want to be on my blacklist, then don't.",
									"EndLoop",
									"JumpToScene", "TalkMenu"]
},
{
	"NameOfScene": "What did you mean by lastime?",
		"theScene": [ "Izebel begins to fluster.",
		              "Speaks3",
								  "Oh...that.",
								  "Speaks3",
								  "I got a little rough with one of Vivian's customers, he was supposed to been one of my toys, but he pissed me off when he chickened out on me.",
								  "Speaks3",
								  "I still think the fucker had it coming, but when he tried to run, I grabbed him and threw him down the stairs and into the tables in the bar.",
								  "Speaks3",
								  "I would've done more if a red oni hadn't of stopped me, think her name was Himiko, but she and Belle were the only ones that's matched my strength.",
                  "Speaks3",
									"It was a mess, I got an earful from Vivian and had to pay for a lot of the damages. Despite Vivian understanding why I got mad, I still don't like thinking about it much. Best left forgotten."]
},
{
	"NameOfScene": "Nevermind",
		"theScene": [ "JumpToScene", "KeepingCompanyMenu"]
},
{ "NameOfScene": "Hug",
		"theScene": [ "Izebel gives a sultry look as she grabs you with one arm",
								 	"Speaks3",
								 	"Oh? So you want a hug? I suppose I could, I like to cuddle.♥",
									"With the force of a bear she throws you on top of her as she begins to wrap her arms around you and begins to entwine her lips with yours. Giving you a gentle loving kiss that drives your mind wild.",
									"You realize she's actually stronger than she looks as her hold on you around your back tightens, further pressing you against her body, her breasts giving you soft cushion of comfort.",
									"However, you pay no mind to her strength as she keeps you locked in the romantic bliss of her soft black lips, you start to long for it to continue only for her to pull away as she intimately bites your lip with a blush on her face.",
									"Speaks3",
									"Mmmmm♥♥...Mmhmmm, you're very passionate, I like that in a person~",
									"Speaks3",
									"But...this was just a freebie, if you really want to be intimate...I have a price.",
									"She releases you and throws you on the side of the bed, crawling on top.",
									"EndLoop",
									"JumpToScene", "KeepingCompanyMenu"]
},
{
	"NameOfScene": "Sex",
    "theScene": [ "She gives a devious smile as she lays herself on top of you, pressing her breasts against your chest and resting her bottom on your manhood, teasing you with her voluptuous touch. Her face so close to yours, you take in her pleasant perfume",
									"Speaks3",
									"I see...honestly, I don't mind at all. I'll do whatever you want. But, I also have to make a living outside of my shop, and I'm not your everyday prostitute, so I hope you have the pouch for it.",
									"Menu",
									"Blowjob - 6,000 Eros",
									"Titjob - 8,000 Eros",
									"Intercourse - 12,000 Base Fee",
									"EndLoop"]
},
{
	"NameOfScene": "Intercourse - 12,000 Eros Base Fee",
	  "theScene": [ "She gives an amused grin and blushes at the sound of that option",
		              "Speaks3",
								  "Oh? And how do you want to breed?",
									"Your body tenses as her voice melts your mind at the thought of her choice of words",
								  "Menu",
								  "Vanilla Sex - 4,000 Eros",
								  "Bear Hug Press - 4,000 Eros",
								  "EndLoop"]
},
{
	"NameOfScene": "Blowjob - 6,000 Eros",
	  "theScene": [ "Speaks3",
									"Hmph, pretty cheap wouldn't you say? But I guess I don't mind.",
									"Speaks3",
									"Pay up, and I'll make sure you'll enjoy it.",
									"ChangeEros", "-6000",
		              "Speaks3",
								  "Good boy~",
								  "Izebel then catches you off guard by holding both of your arms down on the bed and your legs pinned beneath her as she begins to pepper your face with loving kisses from her black lips. You cannot move as she is clearly taking control with her strength, but you don't mind as you passionately kiss her back. She then moves her lips to the side of your neck as she continues her assault causing you to already moan in pleasure.",
								  "Speaks3",
								  "Mmhmm, even without my lipstick's aphrodiasiacs, you look like you're enjoying yourself, I but I promise you, I haven't even started yet.",
								  "She continues to pepper you with kisses as she then lowers herself guiding her claws along your chest, she lifts your shirt up so she can see your stomach and placing gentle kisses on it as she continues to go lower. She then takes her right arm and places it on your torso keeping you pinned down, but you also then place a hand on top of hers. She blushes slightly.",
								  "Speaks3",
								  "Oh? Holding my bear claw with your hand? Don't tell me you're that kind.",
								  "She uses her left arm and begins to remove your pants and undergarments in small motion as one of her claw continues to gently glide across your skin. Your cock finally finds its freedom feeling the air and giving a small light smack as it hits the side of her face. Causing you both to moan.",
								  "Speaks3",
								  "Mmm, what do we have here big boy?",
								  "She then licks up the shaft causing you to shiver as pleasure courses through you. She then gives a small gentle kiss on your tip and continues to pepper your length causing you to hold her hand tighter causing her to giggle.",
								  "Speaks3",
								  "You ARE that kind...you look so cute when you moan.",
								  "Without warning, she takes in your throbbing manhood into her mouth licking your shaft as another shiver of pleasure courses through you. She realizes the aphrodiasiacs from her lipstick had begun taking the toll on his member and starts to bob her head. Your pre-cum already helping her with the lubrication.",
								  "You begin to take your other arm and try to hold her head only for her to take your hand with her left hand and hold it to the bed, embracing and holding your other hand.",
								  "Her head movements begin to take their toll as the combined aphrodiasiacs, her skillfulness of her oral assault, and the hand holding floods your mind with a huge need to blow your load.",
								  "However, she denies your need by discontinuing her movings and letting a resounding pop as your dick escapes her mouth. She giggles as she watches the anquish and need on your face as her breathes continue to tease your cock",
								  "Speaks3",
								  "Don't forget, I'm in control here, if you want to cum, it'll only be when I'm ready my aphrodiasiacs will make sure of that.",
								  "She takes in your length once again and begins at a slow pace hoping to prolong the orgasm as much as possible, occassionally stopping letting your dick free and licking all up and down your shaft, peppering it with more kisses.",
								  "Her continous worship of your manhood begins to take its toll on you, your cock throbbing with aching need. She suddenly stops looking satisfied at your face knowing your climax was near.",
									"She takes one final lick of your cock as she kisses your tip smiling at you.",
									"Speaks3",
									"I can see your at your limit, guess we'll finish this session then.",
									"She begins to bob her head once again on your dick, this time and at much a more faster and skilled pace, she then lets off pressure from your torso from her right arm as to signal, which you answer by moving your lower body in rhythm with her movements, causing her you both to moan.",
								  "As your throbbing manhood becomes hotter, she makes a final swift motion taking all your length in causing you to finally unload your seed into her throat. She gracefully swallows all she can before coming back up and freeing your cock to the air with a pop as semen trails from her mouth and some hitting her face as you still continue to spurt even afterwards."]
},
{
}
]
}
