{
  "name": "Bamboo Cemetary",
  "CardType": "Event",
  "CardLimit": "1",
  "Description": "Bamboo Road Cemetary, the only cemetery around and left behind by former villagers leaving loved ones behind. Only one grave remains intact thanks to a resident that is often seen paying her respects. At night, it is said that yokai and the undead haunt the cemetary, but no one knows for sure.",
  "requires": [ "Sigil of Will-Power"],
  "Speakers": [
                {
                  "name": "Jiangshi",
                  "postName": "",
                  "SpeakerType": "Monster"
                },
                {
                  "name": "Adult Xiongmao",
                  "postName": "",
                  "SpeakerType": "Monster"
                },
                {
                  "name": "Izebel",
                  "postName": "",
                  "SpeakerType": "Monster"
                }
              ],
  "EventText": [
    {
      "NameOfScene": "EventStart",
      "theScene": [  "IfTimeIs", "DayTrue", "NoJiangshi",
                     "As you continue on your adventure you come across a cemetery where the people of Bamboo Road have been buried.",
                     "DisplayCharacters",
                     "3",
                     "EndLoop",
                     "JumpToScene",
                     "JiangshiEvent"
    ]},
    {
      "NameOfScene": "JiangshiEvent",
      "theScene": [  "Event for night-based fun is not yet available at this time, will update soon. ~Bronzeswagger"
    ]},
    { "NameOfScene": "NoJiangshi",
      "theScene": [  "As you continue on your adventure you come across a cemetery where the people of Bamboo Road have been buried. It almost looked completely abandoned as a lot of the graveyard was in shambles.",
                     "But as you look closer at a few of the graves you notice one where the grass has been kept cut and flourished around the graves and where someone had laid flowers, one grave in particular had a vase of cherry blossoms that were losing petals.",
                     "The name on the marker was old and worn, only the description still remained that was legiable.",
                     "'Until we are together again my love ~Izebel'",
                     "Menu",
                     "Pay Respects",
                     "Continue On Your Way",
                     "EndLoop"
    ]},
    { "NameOfScene": "Pay Respects",
      "theScene": [  "IfHasItem", "Client Card", "Pay Respects Continued",
                     "Its not often I come to the grave and find someone else paying their respects.",
                     "DisplayCharacters",
                     "2",
                     "EndLoop",
                     "You turn around to see what seems like an older but very beautiful Xiongmao with a umbrella.",
                     "PlayerSpeaks",
                     "I hope I'm not intruding.",
                     "Speaks",
                     "Not at all, just so happens I came here for the same thing. This happens to be my husbands grave.",
                     "She walks to your side so elegantly that its almost hard not to stare at her womanly curves and dress, you notice the cherry blossoms in her hand.",
                     "Menu",
                     "Make Conversation?",
                     "Stay Silent",
                     "End Loop"
    ]},
    { "NameOfScene": "Pay Respects Continued",
      "theScene": [  "You pay respects to the grave honoring the dead and after a few minutes of rest, continue to move on your journey."
    ]},
    { "NameOfScene": "Make Conversation?",
      "theScene": [  "PlayerSpeaks",
                     "You've really took care of this grave, unlike other families",
                     "She stays silent, only staring at the grave in front of her, then kneels down to place the cherry blossoms in the vase replacing the ones that were there.",
                     "Speaks",
                     "Someone has to",
                     "She turns to {ThePlayerName}",
                     "Speaks",
                     "Any reason you're here?",
                     "Menu",
                     "Talk about the Dead",
                     "Talk about the Shop",
                     "End Loop"
    ]},
    { "NameOfScene": "Talk about the Dead",
      "theScene": [  "PlayerSpeaks",
                     "Not in particular, I just seen the cemetery and then this grave, thought they must of been really important to someone, so just wanted to pay my respects.",
                     "She smiles at you twirling her umbrella as she walks around working you over with her eyes then stops in front as you meet her gaze.",
                     "Speaks",
                     "I'm sure that he'd of appreciated it. Most others wouldn't of gave a damn.",
                     "You have a hard time not looking at her chest as her cleavage is exposed to you. But think you managed to hide it.",
                     "Speaks",
                     "Hmmm...I like you. Idk how she does it, but Vivian sure knows how to pick her employees.",
                     "You make a surprised look.",
                     "PlayerSpeaks",
                     "You know Vivian? Wait, how did you know who I was?",
                     "She makes a small sultry laugh.",
                     "Speaks",
                     "I own the shop just north of here, so I assumed the goods you were carrying were for me?",
                     "You scratch the back of your head as you let out a small laugh.",
                     "PlayerSpeaks",
                     "Haha, yeah, that'd be me.",
                     "She smiles.",
                     "Speaks",
                     "In that case, just keep carrying those til you reach my store, I would take them from you, but I'm neither in the proper state of dress, nor is my delicate arms suited for labor.",
                     "She begins to walk away, but then stops, turns back around and hands you a blank white card.",
                     "GiveItem", "1", "Client Card",
                     "Speaks",
                     "Hang on to that, you'll need it, and you only get one.",
                     "You stay confused for a moment as the card has nothing exactly remarkable about it and before you can ask, she's already walking away up the road.",
                     "You decided to do what she says and stuff it in your bag, then continue on your journey after paying respects to the reflourished grave."
    ]},
    { "NameOfScene": "Talk about the Shop",
      "theScene": [  "PlayerSpeaks",
                     "Not in particular, I've just been sent to deliver a shipment to a shop near here, saw the grave and just kind of got distracted I guess.",
                     "Her stern gaze looks right through you as if your integrity was in question",
                     "Speaks",
                     "I see..",
                     "She twirls her umbrella as she walks around working you over with her eyes, stopping behinding you and laying a panda arm on your shoulder",
                     "Speaks",
                     "What about this grave has distracted you?",
                     "She gently squeezes just enough that you feel a tiny sense of pain on your shoulder. She smiles as she notices you flinch.",
                     "PlayerSpeaks",
                     "I just appreciated the amount of care of effort that was made to keep their memory alive. They seemed really important.",
                     "She let's out a sultry giggle as she continues to look you over and finally comes into view, meeting your gaze.",
                     "Speaks",
                     "I guess they was important to {i}someone{/i}. That person being me.",
                     "You begin to realize where you fumbled.",
                     "PlayerSpeaks",
                     "Oh-I apologize if I had upset you, never meant to say anything ill about the grave or your husband.",
                     "She laughes and makes a smug smile",
                     "Don't worry about it, no harm done, just be grateful you work for Vivian.",
                     "You make a surprised look.",
                     "PlayerSpeaks",
                     "You know Vivian? Wait, how did you know who I was?",
                     "She makes a sultry laugh.",
                     "Speaks",
                     "I own the shop just north of here, so I assume the goods you mentioned were for me?",
                     "You scratch the back of your head as you let out a small laugh.",
                     "PlayerSpeaks",
                     "Haha, yeah, that'd be me.",
                     "She smiles.",
                     "Speaks",
                     "In that case, just keep carrying those til you reach my store, I would take them from you, but I'm neither in the proper state of dress, nor is my delicate arms suited for labor.",
                     "She begins to walk away, but then stops, turns back around and hands you a blank white card.",
                     "GiveItem", "1", "Client Card",
                     "Speaks",
                     "Hang on to that, you'll need it, and you only get one.",
                     "You stay confused for a moment as the card has nothing exactly remarkable about it and before you can ask, she's already walking away up the road.",
                     "You decided to do what she says and stuff it in your bag, then continue on your journey after paying respects to the reflourished grave."
    ]},
    { "NameOfScene": "Stay Silent",
      "theScene": [  "You just watch and observe as she stays silent, only staring at the grave in front of her, then kneels down to place the cherry blossoms in the vase replacing the ones that were there.",
                     "She turns to {ThePlayerName}",
                     "Speaks",
                     "I always try to keep his vase full of life and change the blossoms every now and then, my husband was someone that'd of done the same for me. So I try to celebrate the life I was given with him best I can.",
                     "You nod in understanding",
                     "PlayerSpeaks",
                     "I consider him very lucky then, not many people I can think of could probably have that done for them.",
                     "She smiles",
                     "Speaks",
                     "Any reason you're here?",
                     "Menu",
                     "Talk about the dead",
                     "End Loop"
    ]}
  ]
  }
